{
  "MACROS": {
    "HEADER": "Macros",
    "HEADER_BTN_TXT": "Adicione um novo macro",
    "HEADER_BTN_TXT_SAVE": "Salvar macro",
    "LOADING": "Buscando macros",
    "SIDEBAR_TXT": "<p><b>Macros</b><p>Uma macro é um conjunto de ações salvas que ajudam os agentes de atendimento ao cliente a concluir tarefas com facilidade. Os agentes podem definir um conjunto de ações como marcar uma conversa com um rótulo, enviar uma transcrição de e-mail, atualizar um atributo personalizado, etc., e podem executar essas ações com um único clique. Quando os agentes executassem a macro, as ações seriam executadas sequencialmente na ordem em que foram definidas. As macros melhoram a produtividade e aumentam a consistência nas ações. </p><p>Uma macro pode ser útil de duas maneiras. </p><p><b>Como agente auxiliar:</b> Se um agente executar um conjunto de ações várias vezes, ele poderá salvá-lo como uma macro e executar todas as ações juntas com um único clique.</p><p><b>Como opção para integrar um membro da equipe:</b> Cada agente deve realizar muitas verificações/ações diferentes durante cada conversa. A integração de um novo membro da equipe de suporte será fácil se macros predefinidas estiverem disponíveis na conta. Em vez de descrever cada etapa detalhadamente, o gestor/líder da equipe pode apontar as macros usadas em diferentes cenários.</p>",
    "ERROR": "Algo deu errado. Por favor, tente novamente",
    "ORDER_INFO": "As macros serão executadas na ordem em que você adiciona suas ações. Você pode reorganizá-los arrastando-os pela alça ao lado de cada nó.",
    "ADD": {
      "FORM": {
        "NAME": {
          "LABEL": "Nome da macro",
          "PLACEHOLDER": "Digite um nome para sua macro",
          "ERROR": "O nome é obrigatório para criar uma macro"
        },
        "ACTIONS": {
          "LABEL": "Ações"
        }
      },
      "API": {
        "SUCCESS_MESSAGE": "Macro adicionada com sucesso",
        "ERROR_MESSAGE": "Não foi possível criar a macro. Tente novamente mais tarde"
      }
    },
    "LIST": {
      "TABLE_HEADER": ["Name", "Created by", "Last updated by", "Visibility"],
      "404": "Nenhuma macro encontrada"
    },
    "DELETE": {
      "TOOLTIP": "Excluir macro",
      "CONFIRM": {
        "MESSAGE": "Você tem certeza que quer deletar ",
        "YES": "Sim, excluir",
        "NO": "Não"
      },
      "API": {
        "SUCCESS_MESSAGE": "Macro excluída com sucesso",
        "ERROR_MESSAGE": "Ocorreu um erro ao excluir a macro. Por favor, tente novamente mais tarde"
      }
    },
    "EDIT": {
      "TOOLTIP": "Editar macro",
      "API": {
        "SUCCESS_MESSAGE": "Macro atualizada com sucesso",
        "ERROR_MESSAGE": "Não foi possível atualizar a macro. Tente novamente mais tarde"
      }
    },
    "EDITOR": {
      "START_FLOW": "Iniciar fluxo",
      "END_FLOW": "Fluxo final",
      "LOADING": "Buscando macro",
      "ADD_BTN_TOOLTIP": "Adicionar nova ação",
      "DELETE_BTN_TOOLTIP": "Excluir ação",
      "VISIBILITY": {
        "LABEL": "Visibilidade Macro",
        "GLOBAL": {
          "LABEL": "Público",
          "DESCRIPTION": "Esta macro está disponível publicamente para todos os agentes desta conta."
        },
        "PERSONAL": {
          "LABEL": "Privado",
          "DESCRIPTION": "Esta macro será privada para você e não estará disponível para outras pessoas."
        }
      }
    },
    "EXECUTE": {
      "BUTTON_TOOLTIP": "Executar",
      "PREVIEW": "Visualizar macro",
      "EXECUTED_SUCCESSFULLY": "Macro executada com sucesso"
    }
  }
}
